import { Sms } from "../../componenst/sms";
import * as S from "./style";

export function Chat() {
  return (
    <S.Chat>
      <S.Chat_area>
        <Sms
        sender='1'
          text="Это означает, что в Вашем доме, офисе, кабинете, мастерской хранятся
        ценности бóльшие, чем просто деньги или драгоценности, - культурные
        ценности. Произведения искусства, антиквариат, иные предметы
        коллекционирования – все это имущество, безусловно высокая стоимость
        которого."
        />
        <Sms sender='2' text="Это означает" />
        <Sms sender='1' text="доме, офисе, кабинете, мастерской" />
        <Sms sender='2' text="Это означает" />
        <Sms sender='1' text="доме, офисе, кабинете, мастерской" />
        <Sms
        sender='1'
          text="Это означает, что в Вашем доме, офисе, кабинете, мастерской хранятся
        ценности бóльшие, чем просто деньги или драгоценности, - культурные
        ценности. Произведения искусства, антиквариат, иные предметы
        коллекционирования – все это имущество, безусловно высокая стоимость
        которого."
        />
        <Sms sender='2' text="Это означает" />
        <Sms sender='1' text="доме, офисе, кабинете, мастерской" />
        <Sms sender='2' text="Это означает" />
        <Sms sender='1' text="доме, офисе, кабинете, мастерской" /><Sms
        sender='1'
          text="Это означает, что в Вашем доме, офисе, кабинете, мастерской хранятся
        ценности бóльшие, чем просто деньги или драгоценности, - культурные
        ценности. Произведения искусства, антиквариат, иные предметы
        коллекционирования – все это имущество, безусловно высокая стоимость
        которого."
        />
        <Sms sender='2' text="Это означает" />
        <Sms sender='1' text="доме, офисе, кабинете, мастерской" />
        <Sms sender='2' text="Это означает" />
        <Sms sender='1' text="доме, офисе, кабинете, мастерской" /><Sms
        sender='1'
          text="Это означает, что в Вашем доме, офисе, кабинете, мастерской хранятся
        ценности бóльшие, чем просто деньги или драгоценности, - культурные
        ценности. Произведения искусства, антиквариат, иные предметы
        коллекционирования – все это имущество, безусловно высокая стоимость
        которого."
        />
        <Sms sender='2' text="Это означает" />
        <Sms sender='1' text="доме, офисе, кабинете, мастерской" />
        <Sms sender='2' text="Это означает" />
        <Sms sender='1' text="доме, офисе, кабинете, мастерской" /><Sms
        sender='1'
          text="Это означает, что в Вашем доме, офисе, кабинете, мастерской хранятся
        ценности бóльшие, чем просто деньги или драгоценности, - культурные
        ценности. Произведения искусства, антиквариат, иные предметы
        коллекционирования – все это имущество, безусловно высокая стоимость
        которого."
        />
        <Sms sender='2' text="Это означает" />
        <Sms sender='1' text="доме, офисе, кабинете, мастерской" />
        <Sms sender='2' text="Это означает" />
        <Sms sender='1' text="доме, офисе, кабинете, мастерской" />
      </S.Chat_area>
      <S.Chat_smail>
        <S.Chat_text>Cadsdafafafaf</S.Chat_text>
        <S.Button>Отправить</S.Button>
      </S.Chat_smail>
    </S.Chat>
  );
}
